MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX154F128D.atdf
      <value-group caption="JTAG Port Enable bit" name="DEVCFG0__JTAGEN">
         <value caption="JTAG Port Enabled" name="ON" value="0x1" />
         <value caption="JTAG Disabled" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="In-Circuit Emulator/Debugger Communication Channel Select bits" name="DEVCFG0__ICESEL">
         <value caption="Communicate on PGEC1/PGED1" name="ICS_PGx1" value="0x3" />
         <value caption="Communicate on PGEC2/PGED2" name="ICS_PGx2" value="0x2" />
         <value caption="Communicate on PGEC3/PGED3" name="ICS_PGx3" value="0x1" />
         <value caption="Communicate on PGEC4/PGED4" name="ICS_PGx4" value="0x0" />
      </value-group>
      <value-group caption="Program Flash Write-Protect bits" name="DEVCFG0__PWP">
         <value caption="Disable" name="OFF" value="0xff" />
         <value caption="First 4K" name="PWP4K" value="0xfe" />
         <value caption="First 8K" name="PWP8K" value="0xfd" />
         <value caption="First 12K" name="PWP12K" value="0xfc" />
         <value caption="First 16K" name="PWP16K" value="0xfb" />
         <value caption="First 20K" name="PWP20K" value="0xfa" />
         <value caption="First 24K" name="PWP24K" value="0xf9" />
         <value caption="First 28K" name="PWP28K" value="0xf8" />
         <value caption="First 32K" name="PWP32K" value="0xf7" />
         <value caption="First 36K" name="PWP36K" value="0xf6" />
         <value caption="First 40K" name="PWP40K" value="0xf5" />
         <value caption="First 44K" name="PWP44K" value="0xf4" />
         <value caption="First 48K" name="PWP48K" value="0xf3" />
         <value caption="First 52K" name="PWP52K" value="0xf2" />
         <value caption="First 56K" name="PWP56K" value="0xf1" />
         <value caption="First 60K" name="PWP60K" value="0xf0" />
         <value caption="First 64K" name="PWP64K" value="0xef" />
         <value caption="First 68K" name="PWP68K" value="0xee" />
         <value caption="First 72K" name="PWP72K" value="0xed" />
         <value caption="First 76K" name="PWP76K" value="0xec" />
         <value caption="First 80K" name="PWP80K" value="0xeb" />
         <value caption="First 84K" name="PWP84K" value="0xea" />
         <value caption="First 88K" name="PWP88K" value="0xe9" />
         <value caption="First 92K" name="PWP92K" value="0xe8" />
         <value caption="First 96K" name="PWP96K" value="0xe7" />
         <value caption="First 100K" name="PWP100K" value="0xe6" />
         <value caption="First 104K" name="PWP104K" value="0xe5" />
         <value caption="First 108K" name="PWP108K" value="0xe4" />
         <value caption="First 112K" name="PWP112K" value="0xe3" />
         <value caption="First 116K" name="PWP116K" value="0xe2" />
         <value caption="First 120K" name="PWP120K" value="0xe1" />
         <value caption="First 124K" name="PWP124K" value="0xe0" />
         <value caption="First 128K" name="PWP128K" value="0xdf" />
         <value caption="First 132K" name="PWP132K" value="0xde" />
         <value caption="First 136K" name="PWP136K" value="0xdd" />
         <value caption="First 140K" name="PWP140K" value="0xdc" />
         <value caption="First 144K" name="PWP144K" value="0xdb" />
         <value caption="First 148K" name="PWP148K" value="0xda" />
         <value caption="First 152K" name="PWP152K" value="0xd9" />
         <value caption="First 156K" name="PWP156K" value="0xd8" />
         <value caption="First 160K" name="PWP160K" value="0xd7" />
         <value caption="First 164K" name="PWP164K" value="0xd6" />
         <value caption="First 168K" name="PWP168K" value="0xd5" />
         <value caption="First 172K" name="PWP172K" value="0xd4" />
         <value caption="First 176K" name="PWP176K" value="0xd3" />
         <value caption="First 180K" name="PWP180K" value="0xd2" />
         <value caption="First 184K" name="PWP184K" value="0xd1" />
         <value caption="First 188K" name="PWP188K" value="0xd0" />
         <value caption="First 192K" name="PWP192K" value="0xcf" />
         <value caption="First 196K" name="PWP196K" value="0xce" />
         <value caption="First 200K" name="PWP200K" value="0xcd" />
         <value caption="First 204K" name="PWP204K" value="0xcc" />
         <value caption="First 208K" name="PWP208K" value="0xcb" />
         <value caption="First 212K" name="PWP212K" value="0xca" />
         <value caption="First 216K" name="PWP216K" value="0xc9" />
         <value caption="First 220K" name="PWP220K" value="0xc8" />
         <value caption="First 224K" name="PWP224K" value="0xc7" />
         <value caption="First 228K" name="PWP228K" value="0xc6" />
         <value caption="First 232K" name="PWP232K" value="0xc5" />
         <value caption="First 236K" name="PWP236K" value="0xc4" />
         <value caption="First 240K" name="PWP240K" value="0xc3" />
         <value caption="First 244K" name="PWP244K" value="0xc2" />
         <value caption="First 248K" name="PWP248K" value="0xc1" />
         <value caption="First 252K" name="PWP252K" value="0xc0" />
         <value caption="First 256K" name="PWP256K" value="0xbf" />
      </value-group>
      <value-group caption="Soft Master Clear Enable bit" name="DEVCFG0__SMCLR">
         <value caption="MCLR pin generates an emulated POR Reset" name="MCLR_POR" value="0x0" />
         <value caption="MCLR pin generates a normal system Reset" name="MCLR_NORM" value="0x1" />
      </value-group>
      <value-group caption="Boot Flash Write-Protect bit" name="DEVCFG0__BWP">
         <value caption="Protection Enabled" name="ON" value="0x0" />
         <value caption="Protection Disabled" name="OFF" value="0x1" />
      </value-group>
      <value-group caption="Code-Protect bit" name="DEVCFG0__CP">
         <value caption="Protection Enabled" name="ON" value="0x0" />
         <value caption="Protection Disabled" name="OFF" value="0x1" />
      </value-group>
   </module>
   <module caption="" id="02486" name="ADC" version="2">
      <register-group name="ADC">
         <register caption="ADC Control Register 1" name="AD1CON1" offset="0x0" rw="RW" size="4" initval="0x0">
            <bitfield caption="Analog-to-Digital Conversion Status bit" mask="0x00000001" name="DONE" values="AD1CON1__DONE" />
            <bitfield caption="ADC Sample Enable bit" mask="0x00000002" name="SAMP" values="AD1CON1__SAMP" />
            <bitfield caption="ADC Sample Auto-Start bit" mask="0x00000004" name="ASAM" values="AD1CON1__ASAM" />
            <bitfield caption="Stop Conversion Sequence bit (when the first ADC interrupt is generated)" mask="0x00000010" name="CLRASAM" values="AD1CON1__CLRASAM" />
            <bitfield caption="Conversion Trigger Source Select bits" mask="0x000000E0" name="SSRC" values="AD1CON1__SSRC" />
            <bitfield caption="Data Output Format bits" mask="0x00000700" name="FORM" values="AD1CON1__FORM" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="AD1CON1__SIDL" />
            <bitfield caption="ADC Operating Mode bit" mask="0x00008000" name="ON" values="AD1CON1__ON" />
         </register>
