MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX154F128D.atdf
         <register caption="" name="PRId" offset="0xa8" rw="R" size="4">
            <bitfield mask="0x00000003" name="Patch" />
            <bitfield mask="0x0000001C" name="MINrev" />
            <bitfield mask="0x000000E0" name="MAJrev" />
            <bitfield mask="0x0000FF00" name="PrID" />
            <bitfield mask="0x00FF0000" name="CoID" />
         </register>
         <register caption="" name="EBASE" offset="0xac" rw="RW" size="4">
            <bitfield mask="0x000003FF" name="CPUNum" />
            <bitfield mask="0x3FFFF000" name="ExBase" />
         </register>
         <register caption="" name="Config" offset="0xb0" rw="RW" size="4">
            <bitfield mask="0x00000007" name="K0" />
            <bitfield mask="0x00000380" name="MT" />
            <bitfield mask="0x00001C00" name="AR" />
            <bitfield mask="0x00006000" name="AT" />
            <bitfield mask="0x00008000" name="BE" />
            <bitfield mask="0x00010000" name="DS" />
            <bitfield mask="0x00100000" name="MDU" />
            <bitfield mask="0x00200000" name="SB" />
            <bitfield mask="0x00400000" name="UDI" />
            <bitfield mask="0x0E000000" name="KU" />
            <bitfield mask="0x70000000" name="K23" />
            <bitfield mask="0x80000000" name="M" />
         </register>
         <register caption="" name="Config1" offset="0xb4" rw="R" size="4">
            <bitfield mask="0x00000001" name="FP" />
            <bitfield mask="0x00000002" name="EP" />
            <bitfield mask="0x00000004" name="CA" />
            <bitfield mask="0x00000008" name="WR" />
            <bitfield mask="0x00000010" name="PC" />
            <bitfield mask="0x00000020" name="MD" />
            <bitfield mask="0x00000040" name="C2" />
            <bitfield mask="0x00000380" name="DA" />
            <bitfield mask="0x00001C00" name="DL" />
            <bitfield mask="0x0000E000" name="DS" />
            <bitfield mask="0x00070000" name="IA" />
            <bitfield mask="0x00380000" name="IL" />
            <bitfield mask="0x01C00000" name="IS" />
            <bitfield mask="0x7E000000" name="MMUsz" />
            <bitfield mask="0x80000000" name="M" />
         </register>
         <register caption="" name="Config2" offset="0xb8" rw="R" size="4">
            <bitfield mask="0x80000000" name="M" />
         </register>
         <register caption="" name="Config3" offset="0xbc" rw="R" size="4">
            <bitfield mask="0x00000001" name="TL" />
            <bitfield mask="0x00000002" name="SM" />
            <bitfield mask="0x00000010" name="SP" />
            <bitfield mask="0x00000020" name="VInt" />
            <bitfield mask="0x00000040" name="VEIC" />
            <bitfield mask="0x00000100" name="ITL" />
            <bitfield mask="0x80000000" name="M" />
         </register>
         <register caption="" name="Debug" offset="0xc0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="DSS" />
            <bitfield mask="0x00000002" name="DBp" />
            <bitfield mask="0x00000004" name="DDBL" />
            <bitfield mask="0x00000008" name="DDBS" />
            <bitfield mask="0x00000010" name="DIB" />
            <bitfield mask="0x00000020" name="DINT" />
            <bitfield mask="0x000000C0" name="R" />
            <bitfield mask="0x00000100" name="SSt" />
            <bitfield mask="0x00000200" name="NoSST" />
            <bitfield mask="0x00007C00" name="DExcCode" />
            <bitfield mask="0x00038000" name="Ver" />
            <bitfield mask="0x00040000" name="DDBLImpr" />
            <bitfield mask="0x00080000" name="DDBSImpr" />
            <bitfield mask="0x00100000" name="IEXI" />
            <bitfield mask="0x00200000" name="DBusEP" />
            <bitfield mask="0x00400000" name="CacheEP" />
            <bitfield mask="0x00800000" name="MCheckP" />
            <bitfield mask="0x01000000" name="IBusEP" />
            <bitfield mask="0x02000000" name="CountDM" />
            <bitfield mask="0x04000000" name="Halt" />
            <bitfield mask="0x08000000" name="Doze" />
            <bitfield mask="0x10000000" name="LSNM" />
            <bitfield mask="0x20000000" name="NoDCR" />
            <bitfield mask="0x40000000" name="DM" />
            <bitfield mask="0x80000000" name="DBD" />
         </register>
         <register caption="" name="TraceControl" offset="0xc4" rw="RW" size="4">
            <bitfield mask="0x00000001" name="On" />
            <bitfield mask="0x0000000E" name="Mode" />
            <bitfield mask="0x00000010" name="G" />
            <bitfield mask="0x00001FE0" name="ASID" />
            <bitfield mask="0x001FE000" name="ASID_M" />
            <bitfield mask="0x00200000" name="U" />
            <bitfield mask="0x00400000" name="S" />
            <bitfield mask="0x00800000" name="K" />
            <bitfield mask="0x01000000" name="E" />
            <bitfield mask="0x02000000" name="D" />
            <bitfield mask="0x04000000" name="IO" />
            <bitfield mask="0x08000000" name="TB" />
            <bitfield mask="0x40000000" name="UT" />
            <bitfield mask="0x80000000" name="TS" />
         </register>
         <register caption="" name="TraceControl2" offset="0xc8" rw="R" size="4">
            <bitfield mask="0x00000007" name="SyP" />
            <bitfield mask="0x00000008" name="TBU" />
            <bitfield mask="0x00000010" name="TBI" />
            <bitfield mask="0x00000060" name="ValidModes" />
         </register>
         <register caption="" name="UserTraceData" offset="0xcc" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="Data" />
         </register>
         <register caption="" name="TraceBPC" offset="0xd0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IBPOn" />
            <bitfield mask="0x00008000" name="IE" />
            <bitfield mask="0x00030000" name="DBPOn" />
            <bitfield mask="0x80000000" name="DE" />
         </register>
         <register caption="" name="Debug2" offset="0xd4" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="debug2" />
         </register>
         <register caption="" name="DEPC" offset="0xd8" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DEPC" />
         </register>
         <register caption="" name="ErrorEPC" offset="0xdc" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ErrorEPC" />
         </register>
         <register caption="" name="DESAVE" offset="0xe0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DESAVE" />
         </register>
         <register caption="" name="lo" offset="0xe4" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="MDUlow" />
         </register>
         <register caption="" name="hi" offset="0xe8" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="MDUhigh" />
         </register>
      </register-group>
   </module>
   <module caption="" id="03100" name="OSC" version="">
      <register-group name="OSC">
         <register caption="Oscillator Control Register" name="OSCCON" offset="0x0" rw="RW" size="4" initval="0x00000000">
            <bitfield caption="Oscillator Switch Enable bit" mask="0x00000001" name="OSWEN" values="OSCCON__OSWEN" />
            <bitfield caption="Secondary Oscillator Enable bit" mask="0x00000002" name="SOSCEN" values="OSCCON__SOSCEN" />
            <bitfield caption="USB FRC Clock Enable bit" mask="0x00000004" name="UFRCEN" values="OSCCON__UFRCEN" />
            <bitfield caption="Clock Fail Detect bit" mask="0x00000008" name="CF" values="OSCCON__CF" />
            <bitfield caption="Sleep Mode Enable bit" mask="0x00000010" name="SLPEN" values="OSCCON__SLPEN" />
            <bitfield caption="Clock Selection Lock Enable bit" mask="0x00000080" name="CLKLOCK" values="OSCCON__CLKLOCK" />
            <bitfield caption="New Oscillator Selection bits" mask="0x00000700" name="NOSC" values="OSCCON__NOSC" />
            <bitfield caption="Current Oscillator Selection bits" mask="0x00007000" name="COSC" values="OSCCON__COSC" />
            <bitfield caption="Sleep Two-speed Start-up Control bit" mask="0x00200000" name="SLP2SPD" values="OSCCON__SLP2SPD" />
            <bitfield caption="Dream Mode Enable bit" mask="0x00800000" name="DRMEN" values="OSCCON__DRMEN" />
            <bitfield caption="Internal Fast RC Oscillator Clock Divider bits" mask="0x07000000" name="FRCDIV" values="OSCCON__FRCDIV" />
         </register>
         <register caption="FRC Tuning Register" name="OSCTUN" offset="0x10" rw="RW" size="4" initval="0x00000000">
            <bitfield caption="FRC Oscillator Tuning bits" mask="0x0000003F" name="TUN" values="OSCTUN__TUN" />
         </register>
         <register caption="System PLL Control Register" name="SPLLCON" offset="0x20" rw="RW" size="4" initval="0x00000000">
            <bitfield caption="System PLL Input Clock Source bit" mask="0x00000080" name="PLLICLK" values="SPLLCON__PLLICLK" />
            <bitfield caption="System PLL Input Clock Divider bits" mask="0x00000700" name="PLLIDIV" values="SPLLCON__PLLIDIV" />
            <bitfield caption="System PLL Multiplier bits" mask="0x00070000" name="PLLMULT" values="SPLLCON__PLLMULT" />
            <bitfield caption="System PLL Output Clock Divider bits" mask="0x07000000" name="PLLODIV" values="SPLLCON__PLLODIV" />
         </register>
         <register caption="USB PLL Control Register" name="UPLLCON" offset="0x30" rw="RW" size="4" initval="0x01070000">
            <bitfield caption="USB PLL Input Clock Divider bits" mask="0x00000700" name="PLLIDIV" values="UPLLCON__PLLIDIV" />
            <bitfield caption="USB PLL Multiplier bits" mask="0x00070000" name="PLLMULT" values="UPLLCON__PLLMULT" />
            <bitfield caption="USB PLL Output Clock Divider bits" mask="0x07000000" name="PLLODIV" values="UPLLCON__PLLODIV" />
         </register>
         <register caption="Reference Oscillator Control Register" name="REFO1CON" offset="0x80" rw="RW" size="4" initval="0x00000000">
            <bitfield caption="Reference Clock Source Select bits" mask="0x0000000F" name="ROSEL" values="REFO1CON__ROSEL" />
            <bitfield caption="Reference Clock Request Status bit" mask="0x00000100" name="ACTIVE" values="REFO1CON__ACTIVE" />
            <bitfield caption="Divider Switch Enable bit" mask="0x00000200" name="DIVSWEN" values="REFO1CON__DIVSWEN" />
            <bitfield caption="Reference Oscillator Module Run in Sleep bit" mask="0x00000800" name="RSLP" values="REFO1CON__RSLP" />
            <bitfield caption="Reference Clock Output Enable bit" mask="0x00001000" name="OE" values="REFO1CON__OE" />
            <bitfield caption="Peripheral Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="REFO1CON__SIDL" />
            <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="REFO1CON__ON" />
            <bitfield caption="Reference Clock Divider Bits" mask="0x7FFF0000" name="RODIV" values="REFO1CON__RODIV"/>
         </register>
         <register caption="Reference Oscillator Trim Register" name="REFO1TRIM" offset="0x90" rw="RW" size="4" initval="0x00000000">
            <bitfield caption="Reference Oscillator Trim bits" mask="0xFF800000" name="ROTRIM" values="REFO1TRIM__ROTRIM" />
         </register>
         <register caption="Peripheral Bus Clock Divisor Control Register" name="PB1DIV" offset="0x100" rw="RW" size="4" initval="0x00008800">
            <bitfield caption="Peripheral Bus Clock Divisor Control bits" mask="0x0000007F" name="PBDIV" values="PB1DIV__PBDIV" />
            <bitfield caption="Peripheral Bus x Clock Divisor Ready bit" mask="0x00000800" name="PBDIVRDY" values="PB1DIV__PBDIVRDY" />
            <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="PB1DIV__ON" />
         </register>
      </register-group>
