MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX154F128D.atdf
      <value-group caption="Oscillator Switch Enable bit" name="OSCCON__OSWEN">
         <value caption="Initiate an oscillator switch to selection specified by NOSC bits" name="ON" value="0x1" />
         <value caption="Oscillator switch is complete" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Secondary Oscillator Enable bit" name="OSCCON__SOSCEN">
         <value caption="Enable Secondary Oscillator" name="ON" value="0x1" />
         <value caption="Disable Secondary Oscillator" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="USB FRC Clock Enable bit" name="OSCCON__UFRCEN">
         <value caption="Enable FRC as the USB clock source" name="FRC_EN" value="0x1" />
         <value caption="Use the Primary Oscillator or UPLL as the USB clock source" name="FRC_DIS" value="0x0" />
      </value-group>
      <value-group caption="Clock Fail Detect bit" name="OSCCON__CF">
         <value caption="FSCM has detected a clock failure" name="DET" value="0x1" />
         <value caption="No clock failure has been detected" name="NO_DET" value="0x0" />
      </value-group>
      <value-group caption="Sleep Mode Enable bit" name="OSCCON__SLPEN">
         <value caption="Device will enter Sleep mode when a WAIT instruction is executed" name="ENABLE" value="0x1" />
         <value caption="Device will enter Idle mode when a WAIT instruction is executed" name="DISABLE" value="0x0" />
      </value-group>
      <value-group caption="Clock Selection Lock Enable bit" name="OSCCON__CLKLOCK">
         <value caption="Clock and PLL selections are locked" name="ON" value="0x1" />
         <value caption="Clock and PLL selections are not locked and may be modified" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="New Oscillator Selection bits" name="OSCCON__NOSC">
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Internal Low-Power RC (LPRC) Oscillator" name="LPRC" value="0x5" />
         <value caption="Secondary Oscillator (SOSC)" name="SOSC" value="0x4" />
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Primary Oscillator (POSC) (HS or EC)" name="POSC" value="0x2" />
         <value caption="System PLL (SPLL)" name="SPLL" value="0x1" />
         <value caption="Internal Fast RC (FRC) Oscillator divided by FRCDIV bits (FRCDIV)" name="FRC" value="0x0" />
      </value-group>
      <value-group caption="Current Oscillator Selection bits" name="OSCCON__COSC">
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Internal Low-Power RC (LPRC) Oscillator" name="LPRC" value="0x5" />
         <value caption="Secondary Oscillator (SOSC)" name="SOSC" value="0x4" />
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Primary Oscillator (POSC) (HS or EC)" name="POSC" value="0x2" />
         <value caption="System PLL (SPLL)" name="SPLL" value="0x1" />
         <value caption="Internal Fast RC (FRC) Oscillator divided by FRCDIV bits (FRCDIV)" name="FRC" value="0x0" />
      </value-group>
      <value-group caption="Sleep Two-speed Start-up Control bit" name="OSCCON__SLP2SPD">
         <value caption="Use FRC as SYSCLK until the selected clock is ready" name="FRC" value="0x1" />
         <value caption="Use the selected clock directly" name="DIRECT" value="0x0" />
      </value-group>
      <value-group caption="Dream Mode Enable bit" name="OSCCON__DRMEN">
         <value caption="Dream mode is enabled" name="ENABLE" value="0x1" />
         <value caption="Dream mode is disabled" name="DISABLE" value="0x0" />
      </value-group>
      <value-group caption="Internal Fast RC Oscillator Clock Divider bits" name="OSCCON__FRCDIV">
         <value caption="FRC divided by 256" name="DIV_256" value="0x7" />
         <value caption="FRC divided by 64" name="DIV_64" value="0x6" />
         <value caption="FRC divided by 32" name="DIV_32" value="0x5" />
         <value caption="FRC divided by 16" name="DIV_16" value="0x4" />
         <value caption="FRC divided by 8" name="DIV_8" value="0x3" />
         <value caption="FRC divided by 4" name="DIV_4" value="0x2" />
         <value caption="FRC divided by 2" name="DIV_2" value="0x1" />
         <value caption="FRC divided by 1 (default setting)" name="DIV_1" value="0x0" />
      </value-group>
      <value-group caption="FRC Oscillator Tuning bits" name="OSCTUN__TUN">
         <value caption="Center frequency -2%" name="FREQ_MIN" value="0x20" />
         <value caption="Center frequency; Oscillator runs at nominal frequency (8 MHz)" name="FREQ_CTR" value="0x0" />
         <value caption="Center frequency +2%" name="FREQ_MAX" value="0x1f" />
      </value-group>
      <value-group caption="System PLL Input Clock Source bit" name="SPLLCON__PLLICLK">
         <value caption="FRC is selected as the input to the System PLL" name="PLL_FRC" value="0x1" />
         <value caption="POSC is selected as the input to the System PLL" name="PLL_POSC" value="0x0" />
      </value-group>
      <value-group caption="System PLL Input Clock Divider bits" name="SPLLCON__PLLIDIV">
         <value caption="Divide by 12" name="DIV_12" value="0x7" />
         <value caption="Divide by 10" name="DIV_10" value="0x6" />
         <value caption="Divide by 6" name="DIV_6" value="0x5" />
         <value caption="Divide by 5" name="DIV_5" value="0x4" />
         <value caption="Divide by 4" name="DIV_4" value="0x3" />
         <value caption="Divide by 3" name="DIV_3" value="0x2" />
         <value caption="Divide by 2" name="DIV_2" value="0x1" />
         <value caption="Divide by 1" name="DIV_1" value="0x0" />
      </value-group>
      <value-group caption="System PLL Multiplier bits" name="SPLLCON__PLLMULT">
         <value caption="Multiply by 24" name="MUL_24" value="0x7" />
         <value caption="Multiply by 21" name="MUL_21" value="0x6" />
         <value caption="Multiply by 20" name="MUL_20" value="0x5" />
         <value caption="Multiply by 19" name="MUL_19" value="0x4" />
         <value caption="Multiply by 18" name="MUL_18" value="0x3" />
         <value caption="Multiply by 17" name="MUL_17" value="0x2" />
         <value caption="Multiply by 16" name="MUL_16" value="0x1" />
         <value caption="Multiply by 15" name="MUL_15" value="0x0" />
      </value-group>
      <value-group caption="System PLL Output Clock Divider bits" name="SPLLCON__PLLODIV">
         <value caption="PLL Divide by 256" name="DIV_256" value="0x7" />
         <value caption="PLL Divide by 64" name="DIV_64" value="0x6" />
         <value caption="PLL Divide by 32" name="DIV_32" value="0x5" />
         <value caption="PLL Divide by 16" name="DIV_16" value="0x4" />
         <value caption="PLL Divide by 8" name="DIV_8" value="0x3" />
         <value caption="PLL Divide by 4" name="DIV_4" value="0x2" />
         <value caption="PLL Divide by 2" name="DIV_2" value="0x1" />
         <value caption="PLL Divide by 1" name="DIV_1" value="0x0" />
      </value-group>
      <value-group caption="USB PLL Input Clock Divider bits" name="UPLLCON__PLLIDIV">
         <value caption="Divide by 12" name="DIV_12" value="0x7" />
         <value caption="Divide by 10" name="DIV_10" value="0x6" />
         <value caption="Divide by 6" name="DIV_6" value="0x5" />
         <value caption="Divide by 5" name="DIV_5" value="0x4" />
         <value caption="Divide by 4" name="DIV_4" value="0x3" />
         <value caption="Divide by 3" name="DIV_3" value="0x2" />
         <value caption="Divide by 2" name="DIV_2" value="0x1" />
         <value caption="Divide by 1" name="DIV_1" value="0x0" />
      </value-group>
      <value-group caption="USB PLL Multiplier bits" name="UPLLCON__PLLMULT">
         <value caption="Multiply by 24" name="MUL_24" value="0x7" />
         <value caption="Multiply by 21" name="MUL_21" value="0x6" />
         <value caption="Multiply by 20" name="MUL_20" value="0x5" />
         <value caption="Multiply by 19" name="MUL_19" value="0x4" />
         <value caption="Multiply by 18" name="MUL_18" value="0x3" />
         <value caption="Multiply by 17" name="MUL_17" value="0x2" />
         <value caption="Multiply by 16" name="MUL_16" value="0x1" />
         <value caption="Multiply by 15" name="MUL_15" value="0x0" />
      </value-group>
      <value-group caption="USB PLL Output Clock Divider bits" name="UPLLCON__PLLODIV">
         <value caption="PLL Divide by 256" name="DIV_256" value="0x7" />
         <value caption="PLL Divide by 64" name="DIV_64" value="0x6" />
         <value caption="PLL Divide by 32" name="DIV_32" value="0x5" />
         <value caption="PLL Divide by 16" name="DIV_16" value="0x4" />
         <value caption="PLL Divide by 8" name="DIV_8" value="0x3" />
         <value caption="PLL Divide by 4" name="DIV_4" value="0x2" />
         <value caption="PLL Divide by 2" name="DIV_2" value="0x1" />
         <value caption="PLL Divide by 1" name="DIV_1" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Source Select bits" name="REFO1CON__ROSEL">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Reserved" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="REFCLKI" name="REFCLKI" value="0x8" />
         <value caption="System PLL output" name="SPLL" value="0x7" />
         <value caption="SOSC" name="SOSC" value="0x5" />
         <value caption="LPRC" name="LPRC" value="0x4" />
         <value caption="FRC" name="FRC" value="0x3" />
         <value caption="POSC" name="POSC" value="0x2" />
         <value caption="PBCLK" name="PBCLK" value="0x1" />
         <value caption="SYSCLK" name="SYSCLK" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Request Status bit" name="REFO1CON__ACTIVE">
         <value caption="Reference clock request is active" name="ACTIVE" value="0x1" />
         <value caption="Reference clock request is not active" name="INACTIVE" value="0x0" />
      </value-group>
      <value-group caption="Divider Switch Enable bit" name="REFO1CON__DIVSWEN">
         <value caption="Divider switch is in progress" name="IN_PROGRESS" value="0x1" />
         <value caption="Divider switch is complete" name="DONE" value="0x0" />
      </value-group>
      <value-group caption="Reference Oscillator Module Run in Sleep bit" name="REFO1CON__RSLP">
         <value caption="Reference Oscillator Module output continues to run in Sleep" name="ENABLE" value="0x1" />
         <value caption="Reference Oscillator Module output is disabled in Sleep" name="DISABLE" value="0x0" />
      </value-group>
