MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX154F128D.atdf
      <value-group caption="Edge 1 Polarity Select bit" name="CTMUCON__EDG1POL">
         <value caption="Edge1 programmed for a positive edge response" name="" value="0x1" />
         <value caption="Edge1 programmed for a negative edge response" name="" value="0x0" />
      </value-group>
      <value-group caption="Edge1 Edge Sampling Select bit" name="CTMUCON__EDG1MOD">
         <value caption="Input is edge-sensitive" name="" value="0x1" />
         <value caption="Input is level-sensitive" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00800" name="CVR" version="1">
      <register-group name="CVR">
         <register caption="Comparator Voltage Reference Control Register" name="CVRCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="CVref Value Selection" mask="0x0000000F" name="CVR" values="CVRCON__CVR" />
            <bitfield caption="CVref Source Selection bit" mask="0x00000010" name="CVRSS" values="CVRCON__CVRSS" />
            <bitfield caption="CVref Range Selection bit" mask="0x00000020" name="CVRR" values="CVRCON__CVRR" />
            <bitfield caption="CVrefout Enable bit" mask="0x00000040" name="CVROE" values="CVRCON__CVROE" />
            <bitfield caption="Comparator Voltage Reference On bit" mask="0x00008000" name="ON" values="CVRCON__ON" />
         </register>
      </register-group>
      <value-group caption="CVref Value Selection" name="CVRCON__CVR">
         <value caption="(When CVRR is 1) CVREF is (15/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (15/32)*CVRSRC" name="" value="0xf" />
         <value caption="(When CVRR is 1) CVREF is (14/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (14/32)*CVRSRC" name="" value="0xe" />
         <value caption="(When CVRR is 1) CVREF is (13/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (13/32)*CVRSRC" name="" value="0xd" />
         <value caption="(When CVRR is 1) CVREF is (12/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (12/32)*CVRSRC" name="" value="0xc" />
         <value caption="(When CVRR is 1) CVREF is (11/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (11/32)*CVRSRC" name="" value="0xb" />
         <value caption="(When CVRR is 1) CVREF is (10/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (10/32)*CVRSRC" name="" value="0xa" />
         <value caption="(When CVRR is 1) CVREF is (9/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (9/32)*CVRSRC" name="" value="0x9" />
         <value caption="(When CVRR is 1) CVREF is (8/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (8/32)*CVRSRC" name="" value="0x8" />
         <value caption="(When CVRR is 1) CVREF is (7/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (7/32)*CVRSRC" name="" value="0x7" />
         <value caption="(When CVRR is 1) CVREF is (6/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (6/32)*CVRSRC" name="" value="0x6" />
         <value caption="(When CVRR is 1) CVREF is (5/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (5/32)*CVRSRC" name="" value="0x5" />
         <value caption="(When CVRR is 1) CVREF is (4/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (4/32)*CVRSRC" name="" value="0x4" />
         <value caption="(When CVRR is 1) CVREF is (3/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (3/32)*CVRSRC" name="" value="0x3" />
         <value caption="(When CVRR is 1) CVREF is (2/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (2/32)*CVRSRC" name="" value="0x2" />
         <value caption="(When CVRR is 1) CVREF is (1/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (1/32)*CVRSRC" name="" value="0x1" />
         <value caption="(When CVRR is 1) CVREF is (0/24) * CVRSRC / (When CVRR is 0) CVREF is CVRSRC/4 + (0/32)*CVRSRC" name="" value="0x0" />
      </value-group>
      <value-group caption="CVref Source Selection bit" name="CVRCON__CVRSS">
         <value caption="Comparator voltage reference source CVrsrc = (Vref+) - (Vref-)" name="" value="0x1" />
         <value caption="Comparator voltage reference source CVrsrc = AVdd - AVss" name="" value="0x0" />
      </value-group>
      <value-group caption="CVref Range Selection bit" name="CVRCON__CVRR">
         <value caption="0 to 0.67 CVrsrc with CVrsrc/24 step size" name="" value="0x1" />
         <value caption="0.25 CVrsrc to 0.75 CVrsrc with CVrsrc/32 step size" name="" value="0x0" />
      </value-group>
      <value-group caption="CVrefout Enable bit" name="CVRCON__CVROE">
         <value caption="Voltage level is output on CVrefout pin" name="" value="0x1" />
         <value caption="Voltage level is disconnected from CVrefout pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Voltage Reference On bit" name="CVRCON__ON">
         <value caption="Module is enabled. Setting this bit does not affect other bits in the register." name="" value="0x1" />
         <value caption="Module is disabled and does not consume current. Clearing this bit does not affect the other bits in the register." name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00735" name="DMAC" version="1">
      <register-group name="DMAC">
         <register caption="DMA Controller Control Register" name="DMACON" offset="0x0" rw="RW" size="4">
            <bitfield caption="DMA Module Busy bit" mask="0x00000800" name="DMABUSY" values="DMACON__DMABUSY" />
            <bitfield caption="DMA Suspend bit" mask="0x00001000" name="SUSPEND" values="DMACON__SUSPEND" />
            <bitfield caption="DMA On bit" mask="0x00008000" name="ON" values="DMACON__ON" />
         </register>
         <register caption="DMA Status Register" name="DMASTAT" offset="0x10" rw="RW" size="4">
            <bitfield mask="0x00000007" name="DMACH" />
            <bitfield caption="Read/Write Status bit" mask="0x00000008" name="RDWR" values="DMASTAT__RDWR" />
         </register>
         <register caption="DMA Address Register" name="DMAADDR" offset="0x20" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMAADDR" />
         </register>
         <register caption="DMA CRC Control Register" name="DCRCCON" offset="0x30" rw="RW" size="4">
            <bitfield caption="CRC Channel Select bits" mask="0x00000007" name="CRCCH" values="DCRCCON__CRCCH" />
            <bitfield caption="CRC Type Selection bit" mask="0x00000020" name="CRCTYP" values="DCRCCON__CRCTYP" />
            <bitfield caption="CRC Append Mode bit" mask="0x00000040" name="CRCAPP" values="DCRCCON__CRCAPP" />
            <bitfield caption="CRC Enable bit" mask="0x00000080" name="CRCEN" values="DCRCCON__CRCEN" />
            <bitfield caption="Polynomial Length bits" mask="0x00001F00" name="PLEN" values="DCRCCON__PLEN" />
            <bitfield caption="CRC Bit Order Selection bit" mask="0x01000000" name="BITO" values="DCRCCON__BITO" />
            <bitfield caption="CRC Write Byte Order Selection bit" mask="0x08000000" name="WBO" values="DCRCCON__WBO" />
            <bitfield caption="CRC Byte Order Selection bits" mask="0x30000000" name="BYTO" values="DCRCCON__BYTO" />
         </register>
         <register caption="DMA CRC Data Register" name="DCRCDATA" offset="0x40" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DCRCDATA" />
         </register>
         <register caption="DMA CRCXOR Enable Register" name="DCRCXOR" offset="0x50" rw="RW" size="4">
            <bitfield caption="CRC XOR Register bits" mask="0xFFFFFFFF" name="DCRCXOR" values="DCRCXOR__DCRCXOR" />
         </register>
