MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX154F128D.atdf
      <value-group caption="Channel Transfer Abort Interrupt Enable bit" name="DCH3INT__CHTAIE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell Transfer Complete Interrupt Enable bit" name="DCH3INT__CHCCIE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Block Transfer Complete Interrupt Enable bit" name="DCH3INT__CHBCIE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Half Full Interrupt Enable bit" name="DCH3INT__CHDHIE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Done Interrupt Enable bit" name="DCH3INT__CHDDIE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Half Empty Interrupt Enable bit" name="DCH3INT__CHSHIE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Done Interrupt Enable bit" name="DCH3INT__CHSDIE">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Start Address bits" name="DCH0SSA__CHSSA">
         <value caption="Physical start address 0x00000000" name="" value="0x0" />
         <value caption="Physical start address 0x00000001" name="" value="0x1" />
         <value caption="Physical start address 0x00000002" name="" value="0x2" />
         <value caption="Physical start address 0xffffffff" name="" value="0xffffffff" />
      </value-group>
      <value-group caption="Channel Source Start Address bits" name="DCH1SSA__CHSSA">
         <value caption="Physical start address 0x00000000" name="" value="0x0" />
         <value caption="Physical start address 0x00000001" name="" value="0x1" />
         <value caption="Physical start address 0x00000002" name="" value="0x2" />
         <value caption="Physical start address 0xffffffff" name="" value="0xffffffff" />
      </value-group>
      <value-group caption="Channel Source Start Address bits" name="DCH2SSA__CHSSA">
         <value caption="Physical start address 0x00000000" name="" value="0x0" />
         <value caption="Physical start address 0x00000001" name="" value="0x1" />
         <value caption="Physical start address 0x00000002" name="" value="0x2" />
         <value caption="Physical start address 0xffffffff" name="" value="0xffffffff" />
      </value-group>
      <value-group caption="Channel Source Start Address bits" name="DCH3SSA__CHSSA">
         <value caption="Physical start address 0x00000000" name="" value="0x0" />
         <value caption="Physical start address 0x00000001" name="" value="0x1" />
         <value caption="Physical start address 0x00000002" name="" value="0x2" />
         <value caption="Physical start address 0xffffffff" name="" value="0xffffffff" />
      </value-group>
      <value-group caption="Channel Destination Start Address bits" name="DCH0DSA__CHDSA">
         <value caption="Physical start address 0x00000000" name="" value="0x0" />
         <value caption="Physical start address 0x00000001" name="" value="0x1" />
         <value caption="Physical start address 0x00000002" name="" value="0x2" />
         <value caption="Physical start address 0xffffffff" name="" value="0xffffffff" />
      </value-group>
      <value-group caption="Channel Destination Start Address bits" name="DCH1DSA__CHDSA">
         <value caption="Physical start address 0x00000000" name="" value="0x0" />
         <value caption="Physical start address 0x00000001" name="" value="0x1" />
         <value caption="Physical start address 0x00000002" name="" value="0x2" />
         <value caption="Physical start address 0xffffffff" name="" value="0xffffffff" />
      </value-group>
      <value-group caption="Channel Destination Start Address bits" name="DCH2DSA__CHDSA">
         <value caption="Physical start address 0x00000000" name="" value="0x0" />
         <value caption="Physical start address 0x00000001" name="" value="0x1" />
         <value caption="Physical start address 0x00000002" name="" value="0x2" />
         <value caption="Physical start address 0xffffffff" name="" value="0xffffffff" />
      </value-group>
      <value-group caption="Channel Destination Start Address bits" name="DCH3DSA__CHDSA">
         <value caption="Physical start address 0x00000000" name="" value="0x0" />
         <value caption="Physical start address 0x00000001" name="" value="0x1" />
         <value caption="Physical start address 0x00000002" name="" value="0x2" />
         <value caption="Physical start address 0xffffffff" name="" value="0xffffffff" />
      </value-group>
      <value-group caption="Channel Source Size bits" name="DCH0SSIZ__CHSSIZ">
         <value caption="65535 byte source size" name="" value="0xffff" />
         <value caption="65534 byte source size" name="" value="0xfffe" />
         <value caption="1 byte source size" name="" value="0x1" />
         <value caption="65536 byte source size" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Source Size bits" name="DCH1SSIZ__CHSSIZ">
         <value caption="65535 byte source size" name="" value="0xffff" />
         <value caption="65534 byte source size" name="" value="0xfffe" />
         <value caption="1 byte source size" name="" value="0x1" />
         <value caption="65536 byte source size" name="" value="0x0" />
      </value-group>
